InformationRegisters/АнтропометрияФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АнтропометрияФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рост</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РостДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОдежды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОбуви</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерГоловногоУбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПротивогаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерРеспиратора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПерчаток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерРукавиц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеРазмеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВводаИзмерений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РезультатыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выдано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыдано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокНоскиПродлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноВыдано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДействияСИстекающимиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДействияСИстекающимиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродлитьСрокНоски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СредстваИндивидуальнойЗащиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СредстваИндивидуальнойЗащиты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецХарактеристик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/НормыВыдачиСредствИндивидуальнойЗащиты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = СвойствоСтруктуры(Параметры, "Заголовок", Заголовок);
	РабочееМесто = СвойствоСтруктуры(Параметры, "РабочееМесто");
	Организация = СвойствоСтруктуры(Параметры, "Организация");
	ДатаАктуальности = СвойствоСтруктуры(Параметры, "ДатаАктуальности");
	ПериодичностьТолькоПросмотр = СвойствоСтруктуры(Параметры, "ПериодичностьТолькоПросмотр");
	ТипНоменклатуры = СвойствоСтруктуры(Параметры, "ТипНоменклатуры");
	
	НаименованиеРабочегоМеста = СвойствоСтруктуры(Параметры, "НаименованиеРабочегоМеста");
	Если ЗначениеЗаполнено(РабочееМесто) И Не ЗначениеЗаполнено(НаименованиеРабочегоМеста) Тогда
		НаименованиеРабочегоМеста = Строка(РабочееМесто);
	КонецЕсли;
	
	ФизическоеЛицо = СвойствоСтруктуры(Параметры, "ФизическоеЛицо");
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ПрочитатьАнтропометриюСотрудника(ЭтотОбъект);
		ПоследниеВыдачиСИЗ = СредстваИндивидуальнойЗащиты.ПоследниеВыдачиСИЗПоНоменклатуре(ФизическоеЛицо, Организация, ДатаАктуальности);
		Если ПоследниеВыдачиСИЗ <> Неопределено Тогда
			ПоследниеВыдачиСИЗПоНоменклатуре = ОбщегоНазначения.ФиксированныеДанные(ПоследниеВыдачиСИЗ);
		КонецЕсли;
	КонецЕсли;
	
	ЭтоВыдачаСИЗ = СвойствоСтруктуры(Параметры, "ЭтоВыдачаСИЗ");
	ЭтоПродление = СвойствоСтруктуры(Параметры, "ЭтоПродление");
	ЭтоСписание = СвойствоСтруктуры(Параметры, "ЭтоСписание");
	ЭтоВводОстатков = СвойствоСтруктуры(Параметры, "ЭтоВводОстатков");
	
	УстановитьВидимостьДоступность(ЭтотОбъект);
	УстановитьУсловноеОформление(ЭтотОбъект);
	
	Если Параметры.СИЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаСИЗ Из Параметры.СИЗ Цикл
		НоваяСтрока = СИЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСИЗ);
		ЗаполнитьКомандуПериодичность(НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСИЗ

&НаКлиенте
Процедура СИЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СИЗКомандаПериодичность" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
		ПараметрыОткрытия.Вставить("Периодичность", ТекущиеДанные.ПериодичностьВыдачи);
		ПараметрыОткрытия.Вставить("Кратность", ТекущиеДанные.КратностьВыдачи);
		ПараметрыОткрытия.Вставить("ЕдиницаПериодичности", ТекущиеДанные.ЕдиницаПериодичностиВыдачи);
		ПараметрыОткрытия.Вставить("СпособВыдачи", ТекущиеДанные.СпособВыдачи);
		ПараметрыОткрытия.Вставить("Дежурное", ТекущиеДанные.Дежурное);
		ПараметрыОткрытия.Вставить("ТолькоПросмотр", Элемент.ТолькоПросмотр);
		ПараметрыОткрытия.Вставить("ПериодичностьТолькоПросмотр", ПериодичностьТолькоПросмотр Или Элемент.ТолькоПросмотр);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("УстановитьПериодичностьПослеЗакрытия", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.СрокОбновленияСИЗ",
			ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СИЗПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
	НачатьПодборСИЗ();
КонецПроцедуры

&НаКлиенте
Процедура СИЗОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ЗаполнитьТаблицуДаннымиСИЗ(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СИЗНоменклатураПриИзменении(Элемент)
	УстановитьРезультатВыдачи();
КонецПроцедуры

&НаКлиенте
Процедура СИЗДатаВыдачиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СИЗ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииДатыВыдачиНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура СИЗНоменклатураОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СИЗ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.РезультатВыдачи = ПредопределенноеЗначение("Перечисление.РезультатыВыдачиСИЗ.НеВыдано");
	
КонецПроцедуры

&НаКлиенте
Процедура СИЗДействиеСРанееВыданнымСИЗПриИзменении(Элемент)
	УстановитьРезультатВыдачи();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	МассивСИЗ = Новый Массив();
	
	ПараметрЗакрытия = Новый Структура;

	Отказ = Ложь;
	
	Для Каждого СтрокаСИЗ Из СИЗ Цикл
		ИндексСтроки = СИЗ.Индекс(СтрокаСИЗ);
		ПроверитьЗаполнениеСИЗНоменклатуры(СтрокаСИЗ, ИндексСтроки, Отказ);
		Описание = ОписаниеСтрокиСИЗ(ЭтотОбъект);
		ЗаполнитьЗначенияСвойств(Описание, СтрокаСИЗ);
		МассивСИЗ.Добавить(Описание);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрЗакрытия.Вставить("СИЗ", МассивСИЗ);
	ПараметрЗакрытия.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	ПараметрЗакрытия.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	ПараметрЗакрытия.Вставить("РабочееМесто", РабочееМесто);
	
	Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСИЗ(Команда)
	НачатьПодборСИЗ();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДанныеСИЗ(СИЗ)
	
	Если Не ЗначениеЗаполнено(СИЗ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СИЗ,
		"ВидНоменклатуры,
		|ТипНоменклатуры,
		|СпособВыдачи,
		|КоличествоПоУмолчанию,
		|ЕдиницаИзмерения,
		|КратностьВыдачи,
		|ПериодичностьВыдачи,
		|ЕдиницаПериодичностиВыдачи");
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеСИЗНоменклатуры(СтрокаСИЗ, ИндексСтроки, Отказ)
	
	Если Не ЗначениеЗаполнено(СтрокаСИЗ.СИЗ) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'СИЗ'"));
		Поле = "СИЗ["+ Формат(ИндексСтроки, "ЧДЦ=; ЧГ=0") +"].СИЗ";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
	КонецЕсли;
	
	Если ЭтоВводОстатков Тогда
		Если Не ЗначениеЗаполнено(СтрокаСИЗ.Номенклатура) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Номенклатура'"));
			Поле = "СИЗ["+ Формат(ИндексСтроки, "ЧДЦ=; ЧГ=0") +"].Номенклатура";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаСИЗ.ДатаВыдачи) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Дата выдачи'"));
			Поле = "СИЗ["+ Формат(ИндексСтроки, "ЧДЦ=; ЧГ=0") +"].ДатаВыдачи";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаСИЗ.ДатаСледующейВыдачи) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Дата следующей выдачи'"));
			Поле = "СИЗ["+ Формат(ИндексСтроки, "ЧДЦ=; ЧГ=0") +"].ДатаСледующейВыдачи";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
		КонецЕсли;
		Если СтрокаСИЗ.ДатаСледующейВыдачи < СтрокаСИЗ.ДатаВыдачи Тогда
			ТекстСообщения = НСтр("ru = 'Дата следующей выдачи меньше чем дата выдачи'");
			Поле = "СИЗ["+ Формат(ИндексСтроки, "ЧДЦ=; ЧГ=0") +"].ДатаСледующейВыдачи";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
		КонецЕсли;
		Если СтрокаСИЗ.ДатаВыдачи > ДатаАктуальности Тогда
			ТекстСообщения = НСтр("ru = 'Дата выдачи больше чем дата документа'");
			Поле = "СИЗ["+ Формат(ИндексСтроки, "ЧДЦ=; ЧГ=0") +"].ДатаВыдачи";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
		КонецЕсли;
	ИначеЕсли ЭтоВыдачаСИЗ Тогда
		Если Не ЗначениеЗаполнено(СтрокаСИЗ.Номенклатура)
			И Не СтрокаСИЗ.РезультатВыдачи = ПредопределенноеЗначение("Перечисление.РезультатыВыдачиСИЗ.СрокНоскиПродлен") Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Номенклатура'"));
			Поле = "СИЗ["+ Формат(ИндексСтроки, "ЧДЦ=; ЧГ=0") +"].Номенклатура";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеСтрокиСИЗ(Форма)
	
	ПараметрыОписания = СредстваИндивидуальнойЗащитыКлиентСервер.ПараметрыОписанияСтрокиСИЗ();
	ПараметрыОписания.ДополнитьДляСотрудника = ЗначениеЗаполнено(Форма.ФизическоеЛицо);
	ПараметрыОписания.ДополнитьДляВыдачи = Форма.ЭтоВыдачаСИЗ;
	ПараметрыОписания.ДополнитьДляПродления = Форма.ЭтоПродление;
	ПараметрыОписания.ДополнитьДляСписания = Форма.ЭтоСписание;
	ПараметрыОписания.ДополнитьДляВводаОстатков = Форма.ЭтоВводОстатков;
	
	Возврат СредстваИндивидуальнойЗащитыКлиентСервер.ОписаниеСтрокиСИЗ(ПараметрыОписания);
	
КонецФункции

&НаКлиенте
Процедура УстановитьПериодичностьПослеЗакрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПериодичностьПослеЗакрытияНаСервере(РезультатЗакрытия, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодичностьПослеЗакрытияНаСервере(РезультатЗакрытия, ДополнительныеПараметры)
	
	СтрокаСИЗ = СИЗ.НайтиПоИдентификатору(РезультатЗакрытия.ИдентификаторСтроки);
	СтрокаСИЗ.КратностьВыдачи = РезультатЗакрытия.Кратность;
	СтрокаСИЗ.ПериодичностьВыдачи = РезультатЗакрытия.Периодичность;
	СтрокаСИЗ.ЕдиницаПериодичностиВыдачи = РезультатЗакрытия.ЕдиницаПериодичности;
	СтрокаСИЗ.КомандаПериодичность = РезультатЗакрытия.ПредставлениеПериодичности;
	СтрокаСИЗ.СпособВыдачи = РезультатЗакрытия.СпособВыдачи;
	СтрокаСИЗ.Дежурное = РезультатЗакрытия.Дежурное;
	
	УстановитьДатуСледующейВыдачи(СтрокаСИЗ);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуСледующейВыдачи(СтрокаСИЗ)
	
	Если Не ЭтоВводОстатков Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПериодичности = СредстваИндивидуальнойЗащиты.ОписаниеПериодичностиВыдачи();
	ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, СтрокаСИЗ);
	ОписаниеПериодичности.Кратность = СтрокаСИЗ.КратностьВыдачи;
	ОписаниеПериодичности.Периодичность = СтрокаСИЗ.ПериодичностьВыдачи;
	ОписаниеПериодичности.ЕдиницаПериодичности = СтрокаСИЗ.ЕдиницаПериодичностиВыдачи;
	СтрокаСИЗ.ДатаСледующейВыдачи =
		СредстваИндивидуальнойЗащиты.ДатаСледующейВыдачи(СтрокаСИЗ.ДатаВыдачи, ОписаниеПериодичности);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеПериодичности(Кратность, Периодичность, ЕдиницаПериодичности, СпособВыдачи)
	
	ПредставлениеПериодичности = СредстваИндивидуальнойЗащитыКлиентСервер.ПредставлениеПериодичности(
		Кратность, Периодичность, ЕдиницаПериодичности, , , СпособВыдачи);
	Если Не ЗначениеЗаполнено(ПредставлениеПериодичности) Тогда
		Возврат НСтр("ru = '< Не установлена >'");
	КонецЕсли;
	
	Возврат ПредставлениеПериодичности;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	Параметры = Форма.Параметры;
	ЭтоВыдачаСИЗ = Форма.ЭтоВыдачаСИЗ;
	ЭтоПродление = Форма.ЭтоПродление;
	ЭтоСписание = Форма.ЭтоСписание;
	ЭтоВводОстатков = Форма.ЭтоВводОстатков;
	
	Если ЗначениеЗаполнено(Форма.ТипНоменклатуры) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ДатаАктуальности", "Видимость", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ТипНоменклатуры", "Видимость", Ложь);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ФизическоеЛицо) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ФизическоеЛицо", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗРазмер", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗПоследняяВыдача", "Видимость", Ложь);
	КонецЕсли;
	
	Если Не (ЭтоВыдачаСИЗ Или ЭтоПродление Или ЭтоСписание Или ЭтоВводОстатков) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗНоменклатура", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗХарактеристикаНоменклатуры", "Видимость", Ложь);
	КонецЕсли;
	
	Если Не (ЭтоВыдачаСИЗ Или ЭтоПродление Или ЭтоСписание) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗОснованиеВыдачи", "Видимость", Ложь);
	КонецЕсли;
	
	Если Не (ЭтоПродление Или ЭтоСписание) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗДокументВыдачи", "Видимость", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗРазмер", "Видимость", Ложь);
	КонецЕсли;
	
	Если Не (ЭтоПродление Или ЭтоВводОстатков) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗДатаСледующейВыдачи", "Видимость", Ложь);
	КонецЕсли;
	
	Если ЭтоВыдачаСИЗ Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗПодборСИЗ", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗ", "ИзменятьСоставСтрок", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗРезультатВыдачи", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗДействиеСРанееВыданнымСИЗ", "Видимость", Ложь);
	КонецЕсли;
	
	Если Не ЭтоПродление Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗПродлить", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗПроцентИзноса", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗЗаключение", "Видимость", Ложь);
	КонецЕсли;
	
	Если Не ЭтоСписание Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗПричинаСписания", "Видимость", Ложь);
	КонецЕсли;
	
	Если ЭтоВводОстатков Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗПоследняяВыдача", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗДатаСледующейВыдачи", "АвтоОтметкаНезаполненного", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СИЗДатаВыдачи", "Видимость", Ложь);
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоПросмотр") И Параметры.ТолькоПросмотр = Истина Тогда
		Элементы.СИЗ.ТолькоПросмотр = Истина;
		Элементы.СИЗПодборСИЗ.Доступность = Ложь;
		Элементы.ФормаКомандаОК.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформление(Форма)
	
	Элементы = Форма.Элементы;
	УсловноеОформление = Форма.УсловноеОформление;
	
	// Незаполненная периодичность
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, Элементы.СИЗКомандаПериодичность.ПутьКДанным, НСтр("ru = '< Не установлена >'"));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, "СИЗ.СпособВыдачи", Перечисления.СпособыВыдачиСИЗ.СПериодичностью);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.СИЗКомандаПериодичность.Имя);
	
	// Действия с ранее выданной номенклатурой
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не выдавалось'"));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, Элементы.СИЗПоследняяВыдача.ПутьКДанным, , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.СИЗПоследняяВыдача.Имя);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.СИЗДействиеСРанееВыданнымСИЗ.Имя);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, Элементы.СИЗПоследняяВыдача.ПутьКДанным, , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.СИЗДействиеСРанееВыданнымСИЗ.Имя);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '< Не установлено >'"));
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, Элементы.СИЗПоследняяВыдача.ПутьКДанным, , ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, Элементы.СИЗДействиеСРанееВыданнымСИЗ.ПутьКДанным, , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.СИЗДействиеСРанееВыданнымСИЗ.Имя);
	
	// Результат выдачи
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатПроблемаЦвет);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор,
		Элементы.СИЗРезультатВыдачи.ПутьКДанным,
		Перечисления.РезультатыВыдачиСИЗ.НеВыдано);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.СИЗРезультатВыдачи.Имя);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатУспехЦвет);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, Элементы.СИЗРезультатВыдачи.ПутьКДанным, Перечисления.РезультатыВыдачиСИЗ.Выдано);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.СИЗРезультатВыдачи.Имя);
	
	// Дата следующей выдачи "До износа"
	Если Форма.ЭтоВводОстатков Тогда
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'До износа'"));
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ЭлементУсловногоОформления.Отбор, "СИЗ.СпособВыдачи", Перечисления.СпособыВыдачиСИЗ.ДоИзноса);
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.СИЗДатаСледующейВыдачи.Имя);
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатПроблемаЦвет);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ЭлементУсловногоОформления.Отбор,
			Элементы.СИЗДатаВыдачи.ПутьКДанным,
			Новый ПолеКомпоновкиДанных(Элементы.СИЗДатаСледующейВыдачи.ПутьКДанным),
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.СИЗДатаВыдачи.Имя);
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатПроблемаЦвет);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ЭлементУсловногоОформления.Отбор,
			Элементы.СИЗДатаСледующейВыдачи.ПутьКДанным,
			Форма.ДатаАктуальности,
			ВидСравненияКомпоновкиДанных.Меньше);
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.СИЗДатаСледующейВыдачи.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодборСИЗ()

	ПараметрыФормы = Новый Структура("РежимВыбора, МножественныйВыбор, АдресПодобранных");
	ПараметрыФормы.РежимВыбора = Истина;
	ПараметрыФормы.МножественныйВыбор = Истина;
	ПараметрыФормы.АдресПодобранных = АдресПодобранныхСИЗ();
	
	ПараметрыФормы.Вставить("ТипНоменклатуры", ТипНоменклатуры);
	
	ОткрытьФорму("Справочник.СредстваИндивидуальнойЗащиты.ФормаВыбора", ПараметрыФормы, Элементы.СИЗ);

КонецПроцедуры

&НаСервере
Функция АдресПодобранныхСИЗ()
	Возврат ПоместитьВоВременноеХранилище(СИЗ.Выгрузить().ВыгрузитьКолонку("СИЗ"));
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКомандуПериодичность(НоваяСтрока)
	
	НоваяСтрока.КомандаПериодичность = ПредставлениеПериодичности(
		НоваяСтрока.КратностьВыдачи, НоваяСтрока.ПериодичностьВыдачи, НоваяСтрока.ЕдиницаПериодичностиВыдачи, НоваяСтрока.СпособВыдачи);
	
	Если НоваяСтрока.Дежурное Тогда
		Если НоваяСтрока.КомандаПериодичность = "" Тогда
			НоваяСтрока.КомандаПериодичность = НСтр("ru='Дежурное'");
		Иначе
			НоваяСтрока.КомандаПериодичность = НоваяСтрока.КомандаПериодичность + " - " + НСтр("ru='дежурное'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьАнтропометриюСотрудника(Форма)
	
	НаборЗаписей = РегистрыСведений.АнтропометрияФизическихЛиц.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Форма.ФизическоеЛицо);
	НаборЗаписей.Прочитать();
	
	ЗначениеВДанныеФормы(НаборЗаписей, Форма.АнтропометрияФизическихЛиц);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДаннымиСИЗ(ВыбранноеЗначение)
	
	Перем АнтропометрияСотрудника;
	
	ДанныеСИЗ = ДанныеСИЗ(ВыбранноеЗначение);
	Если АнтропометрияФизическихЛиц.Количество() > 0 Тогда
		АнтропометрияСотрудника = АнтропометрияФизическихЛиц[0];
	КонецЕсли;
	
	Для каждого Значение Из ВыбранноеЗначение Цикл
		НоваяСтрока = СИЗ.Добавить();
		НоваяСтрока.СИЗ = Значение;
		Если ЭтоВыдачаСИЗ Тогда
			НоваяСтрока.РезультатВыдачи = Перечисления.РезультатыВыдачиСИЗ.НеВыдано;
		КонецЕсли;
		ЗначенияРеквизитовСИЗ = ДанныеСИЗ.Получить(Значение);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗначенияРеквизитовСИЗ);
		НоваяСтрока.Количество = ЗначенияРеквизитовСИЗ.КоличествоПоУмолчанию;
		ЗаполнитьКомандуПериодичность(НоваяСтрока);
		Если АнтропометрияСотрудника <> Неопределено Тогда
			НоваяСтрока.Размер = РазмерСотрудника(НоваяСтрока.ТипНоменклатуры, АнтропометрияСотрудника);
		КонецЕсли;
		Если ПоследниеВыдачиСИЗПоНоменклатуре <> Неопределено Тогда
			ПоследняяВыдачаСИЗ = ПоследниеВыдачиСИЗПоНоменклатуре.Получить(НоваяСтрока.СИЗ);
			Если ПоследняяВыдачаСИЗ <> Неопределено Тогда
				НоваяСтрока.ПоследняяВыдача = ПоследняяВыдачаСИЗ.Период;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтоВыдачаСИЗ Или ЭтоВводОстатков Тогда
		СредстваИндивидуальнойЗащиты.ПодобратьПодходящуюНоменклатуру(СИЗ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РазмерСотрудника(ТипНоменклатуры, Антропометрия)
	Возврат СредстваИндивидуальнойЗащиты.РазмерСотрудника(ТипНоменклатуры, Антропометрия);
КонецФункции

&НаКлиенте
Процедура УстановитьРезультатВыдачи()
	
	ТекущиеДанные = Элементы.СИЗ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ДействиеСРанееВыданнымСИЗ = ПредопределенноеЗначение("Перечисление.ДействияСИстекающимиСИЗ.ПродлитьСрокНоски") Тогда
		ТекущиеДанные.РезультатВыдачи = ПредопределенноеЗначение("Перечисление.РезультатыВыдачиСИЗ.СрокНоскиПродлен");
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекущиеДанные.РезультатВыдачи = ПредопределенноеЗначение("Перечисление.РезультатыВыдачиСИЗ.Выдано");
	Иначе
		ТекущиеДанные.РезультатВыдачи = ПредопределенноеЗначение("Перечисление.РезультатыВыдачиСИЗ.НеВыдано");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДатыВыдачиНаСервере(ИдентификаторСтроки)
	УстановитьДатуСледующейВыдачи(СИЗ.НайтиПоИдентификатору(ИдентификаторСтроки));
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
КонецФункции

#КонецОбласти
